Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotCopyCurtainWallGridLines Property
 Curtain wall grid lines currently cannot be copied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCopyCurtainWallGridLines { get; }
Visual Basic
Public Shared ReadOnly Property CannotCopyCurtainWallGridLines As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCopyCurtainWallGridLines {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace